programming/java/keywords.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>keywords</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">keywords</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1307502">flow</a>
<ul>
<li><a href="#org67829f6">loops</a></li>
<li><a href="#org605f61a">if/else</a></li>
<li><a href="#orgb91fc8b">switch statement</a></li>
<li><a href="#org0ad455b">try/ catch</a></li>
<li><a href="#org9574a35">break/continue</a></li>
<li><a href="#org564f973">return</a></li>
</ul>
</li>
<li><a href="#org0f7ff6a">types</a>
<ul>
<li><a href="#orgc07ea5e">numeric</a></li>
<li><a href="#org6575128">other</a></li>
</ul>
</li>
<li><a href="#orgd78451f">modifiers</a>
<ul>
<li><a href="#org4b6bb88">access modifier</a></li>
<li><a href="#org5e88599">non-access modifier</a></li>
</ul>
</li>
<li><a href="#orgae40a93">oo</a></li>
<li><a href="#org11ee025">exceptions and errors</a></li>
<li><a href="#orgde6d0ea">packages and modules</a></li>
<li><a href="#orgf49357a">others</a></li>
<li><a href="#org6415325">not in use</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1307502" class="outline-2">
<h2 id="org1307502">flow</h2>
<div class="outline-text-2" id="text-org1307502">
</div>
<div id="outline-container-org67829f6" class="outline-3">
<h3 id="org67829f6">loops</h3>
<div class="outline-text-3" id="text-org67829f6">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #56b4e9; font-weight: bold;">for</span>   <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Create a for loop</span>
<span style="color: #56b4e9; font-weight: bold;">do</span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Used together with while to create a do-while loop</span>
<span style="color: #56b4e9; font-weight: bold;">while</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Creates a while loop</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org605f61a" class="outline-3">
<h3 id="org605f61a">if/else</h3>
<div class="outline-text-3" id="text-org605f61a">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #56b4e9; font-weight: bold;">if</span>   <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Makes a conditional statement</span>
<span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Used in conditional statements</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb91fc8b" class="outline-3">
<h3 id="orgb91fc8b">switch statement</h3>
<div class="outline-text-3" id="text-orgb91fc8b">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #56b4e9; font-weight: bold;">switch</span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Selects one of many code blocks to be executed</span>
<span style="color: #56b4e9; font-weight: bold;">case</span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Marks a block of code in switch statements</span>
<span style="color: #56b4e9; font-weight: bold;">default</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Specifies the default block of code in a switch statement</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ad455b" class="outline-3">
<h3 id="org0ad455b">try/ catch</h3>
<div class="outline-text-3" id="text-org0ad455b">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #56b4e9; font-weight: bold;">try</span>   <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Creates a try...catch statement</span>
<span style="color: #56b4e9; font-weight: bold;">catch</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Catches exceptions generated by try statements</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9574a35" class="outline-3">
<h3 id="org9574a35">break/continue</h3>
<div class="outline-text-3" id="text-org9574a35">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #56b4e9; font-weight: bold;">break</span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Breaks out of a loop or a switch block</span>
<span style="color: #56b4e9; font-weight: bold;">continue</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Continues to the next iteration of a loop</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org564f973" class="outline-3">
<h3 id="org564f973">return</h3>
<div class="outline-text-3" id="text-org564f973">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Finished the execution of a method, and can be used to</span>
       <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">return a value from a method</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0f7ff6a" class="outline-2">
<h2 id="org0f7ff6a">types</h2>
<div class="outline-text-2" id="text-org0f7ff6a">
</div>
<div id="outline-container-orgc07ea5e" class="outline-3">
<h3 id="orgc07ea5e">numeric</h3>
<div class="outline-text-3" id="text-orgc07ea5e">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0072b2; font-weight: bold;">byte</span>   <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A data type that can store whole numbers from -128 and 127</span>

<span style="color: #0072b2; font-weight: bold;">short</span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A data type that can store whole numbers from -32768 to</span>
       <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">32767</span>

<span style="color: #0072b2; font-weight: bold;">int</span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A data type that can store whole numbers from -2147483648 to</span>
       <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">2147483647</span>

<span style="color: #0072b2; font-weight: bold;">long</span>   <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A data type that can store whole numbers from</span>
       <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">-9223372036854775808 to 9223372036854775808</span>

<span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A data type that can store whole numbers from 1.7e&#8722;308 to</span>
       <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">1.7e+308</span>

<span style="color: #0072b2; font-weight: bold;">float</span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A data type that can store whole numbers from 3.4e&#8722;038 to</span>
       <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">3.4e+038</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6575128" class="outline-3">
<h3 id="org6575128">other</h3>
<div class="outline-text-3" id="text-org6575128">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0072b2; font-weight: bold;">boolean</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A data type that can only store true and false values</span>
<span style="color: #0072b2; font-weight: bold;">char</span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A data type that is used to store a single character</span>
<span style="color: #56b4e9; font-weight: bold;">enum</span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Declares an enumerated (unchangeable) type</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd78451f" class="outline-2">
<h2 id="orgd78451f">modifiers</h2>
<div class="outline-text-2" id="text-orgd78451f">
</div>
<div id="outline-container-org4b6bb88" class="outline-3">
<h3 id="org4b6bb88">access modifier</h3>
<div class="outline-text-3" id="text-org4b6bb88">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #56b4e9; font-weight: bold;">public</span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">An access modifier used for classes, attributes, methods</span>
          <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">and constructors, making them accessible by any other</span>
          <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">class</span>

<span style="color: #56b4e9; font-weight: bold;">private</span>   <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">An access modifier used for attributes, methods and</span>
          <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">constructors, making them only accessible within the</span>
          <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">declared class</span>

<span style="color: #56b4e9; font-weight: bold;">protected</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">An access modifier used for attributes, methods and</span>
          <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">constructors, making them accessible in the same package</span>
          <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">and subclasses</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e88599" class="outline-3">
<h3 id="org5e88599">non-access modifier</h3>
<div class="outline-text-3" id="text-org5e88599">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #56b4e9; font-weight: bold;">static</span>       <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A non-access modifier used for methods and</span>
             <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">attributes. Static methods/attributes can be accessed</span>
             <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">without creating an object of a class</span>

<span style="color: #56b4e9; font-weight: bold;">abstract</span>     <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A non-access modifier. Used for classes and methods: An</span>
             <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">abstract class cannot be used to create objects (to access</span>
             <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">it, it must be inherited from another class). An abstract</span>
             <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">method can only be used in an abstract class, and it does</span>
             <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">not have a body. The body is provided by the subclass</span>
             <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">(inherited from)</span>

<span style="color: #56b4e9; font-weight: bold;">final</span>        <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A non-access modifier used for classes, attributes and</span>
             <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">methods, which makes them non-changeable (impossible to</span>
             <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">inherit or override)</span>

<span style="color: #56b4e9; font-weight: bold;">transient</span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A non-accesss modifier, which specifies that an attribute</span>
             <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">is not part of an object's persistent state</span>

<span style="color: #56b4e9; font-weight: bold;">synchronized</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A non-access modifier, which specifies that methods</span>
             <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">can only be accessed by one thread at a time</span>

<span style="color: #0072b2; font-weight: bold;">void</span>         <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Specifies that a method should not have a return value</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgae40a93" class="outline-2">
<h2 id="orgae40a93">oo</h2>
<div class="outline-text-2" id="text-orgae40a93">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #56b4e9; font-weight: bold;">class</span>      <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Defines a class</span>

<span style="color: #56b4e9; font-weight: bold;">extends</span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Extends a class (indicates that a class is inherited</span>
           <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">from another class)</span>

<span style="color: #56b4e9; font-weight: bold;">interface</span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Used to declare a special type of class that only</span>
           <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">contains abstract methods</span>

<span style="color: #56b4e9; font-weight: bold;">implements</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Implements an interface</span>

<span style="color: #56b4e9; font-weight: bold;">new</span>        <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Creates new objects</span>

<span style="color: #56b4e9; font-weight: bold;">super</span>      <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Refers to superclass (parent) objects</span>

<span style="color: #56b4e9; font-weight: bold;">this</span>       <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Refers to the current object in a method or constructor</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org11ee025" class="outline-2">
<h2 id="org11ee025">exceptions and errors</h2>
<div class="outline-text-2" id="text-org11ee025">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #56b4e9; font-weight: bold;">finally</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Used with exceptions, a block of code that will be executed</span>
        <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">no matter if there is an exception or not</span>

<span style="color: #56b4e9; font-weight: bold;">throw</span>   <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Creates a custom error</span>

<span style="color: #56b4e9; font-weight: bold;">throws</span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Indicates what exceptions may be thrown by a method</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgde6d0ea" class="outline-2">
<h2 id="orgde6d0ea">packages and modules</h2>
<div class="outline-text-2" id="text-orgde6d0ea">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #56b4e9; font-weight: bold;">import</span>   <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Used to import a package, class or interface</span>
<span style="color: #56b4e9; font-weight: bold;">package</span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Declares a package</span>
<span style="color: #d55e00; font-weight: bold;">exports</span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Exports a package with a module. New in Java 9</span>
<span style="color: #0072b2; font-weight: bold;">module</span>   <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Declares a module. New in Java 9</span>
<span style="color: #0072b2; font-weight: bold;">requires</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Specifies required libraries inside a module. New in Java 9</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf49357a" class="outline-2">
<h2 id="orgf49357a">others</h2>
<div class="outline-text-2" id="text-orgf49357a">
<div class="org-src-container">
<pre class="src src-java">assert     <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">For debugging</span>

<span style="color: #56b4e9; font-weight: bold;">instanceof</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Checks whether an object is an instance of a specific</span>
           <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">class or an interface</span>

<span style="color: #56b4e9; font-weight: bold;">native</span>     <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Specifies that a method is not implemented in the same</span>
           <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Java source file (but in another language)</span>

<span style="color: #56b4e9; font-weight: bold;">strictfp</span>   <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Restrict the precision and rounding of floating point</span>
           <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">calculations</span>

var        <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Declares a variable. New in Java 10</span>

<span style="color: #56b4e9; font-weight: bold;">volatile</span>   <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Indicates that an attribute is not cached</span>
           <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">thread-locally, and is always read from the "main</span>
           <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">memory"</span>
</pre>
</div>

<p>
Note:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #d55e00; font-weight: bold;">true</span>, <span style="color: #d55e00; font-weight: bold;">false</span> <span style="color: #d55e00; font-weight: bold;">null</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">not keywords, but they are literals and reserved</span>
                 <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">words that cannot be used as identifiers.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6415325" class="outline-2">
<h2 id="org6415325">not in use</h2>
<div class="outline-text-2" id="text-org6415325">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #56b4e9; font-weight: bold;">const</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Defines a constant. Not in use - use final instead</span>
<span style="color: #56b4e9; font-weight: bold;">goto</span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Not in use, and has no function</span>
</pre>
</div>

<p>
<a href="./java.html">back</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
